package com.sx.util;

public class ContentData {

	//搞笑内容
	private String gaoxiao="当今社会，发财的个体户大都靠什么吃饭?#嘴巴&什么东西要藏起来暗地里用,用完之后再暗地里交给别人?#底片&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输)";
	//幽默
	private String youmo="什么人的工作整天忙得的团团转？#芭蕾舞演员&玲玲没学过算术，老师却夸她的数学是数一数二的,为什么?#从一数到二&当哥伦布一只脚迈上新大陆后,紧接着做什么? #迈另一只脚&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输)";
	//趣味
	private String quwei="红豆家的小孩是谁？#南国（红豆生南国）&有位妈妈生了连体婴，姐姐叫玛丽，那么妹妹叫做什么？#梦露（玛利莲梦露)&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输)";
	//动物类型
	private String dongwu="有两个人掉到陷阱里了，死的人叫死人，活人叫什么？#叫救命啦&有一只鲨鱼吃下了一颗绿豆,结果它变成了什么？#绿豆沙（绿豆鲨）&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输)";
	//经典
	private String jindian="什么车子寸步难行?#风车&小明从不念书却得了模范生,为什么#小明是聋哑学生 &一个盒子有几个边？#两个边。里边和外边&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输)";
	//整人
	private String zhengren="毛毛虫回到家，对爸爸说了一句话，爸爸即场晕倒，毛毛虫说了什么话？ #毛毛虫说：我要买鞋&飞机从天上掉下来，为什么没有一个受伤的？ #全都死了&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输) ";
	//综合类型
	private String zonghe="小明整天说个不停，为什么今天一句话不说了？#因为他嗓子哑了&为什么新买的袜子有两个洞？#要不然怎么穿&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输) ";
	//特色
	private String tese="一双鞋卖16元，一只鞋卖多少钱？# 不卖&哈巴狗去掉尾巴最像什么动物？ 睡觉前要做什么事？# 哈巴狗 闭上眼睛&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输) ";
	//风趣
	private String fengqu="小明的肚子快要涨破了他为什么还要不听的喝水？#小明掉进河里了，他不会游泳&一个司机飞快的从山上冲下来,却没有撞伤人,为什么?#司机并没有开车&包子最怕什么？#最怕豆，因为豆杀包&悟空爬到树上摘香瓜，如果每分钟能摘1个，10分钟可摘几个？#香瓜不长在树上。#今天看了一个新闻，说在智能机大都是直板机的现在，日本依然流行翻盖机！为什么呢？#因为日本人喜欢“啪、啪、啪”的声音&平胸妹子和大胸妹子，那个更容易相处呢？为什么？#平胸妹子更容易相处，因为平易近人&王一和王二俩兄弟爱上了同一个姑娘，为什么最后姑娘选择了王一？#因为王二小&我这个人不咋地，但是我有什么东西我很喜欢，而大多数人不喜欢？你觉得最可能是什么？#我自己&什么东西肥得快，瘦得更快？#气球&什么笔不能写？#试电笔&两只蚂蚁抬根杠,一只蚂蚁杠上望？猜一个字#六&一座桥上面立有一牌，牌上写“不准过桥”。但是很多人都不理睬，照样过去。你说为什么？#这座桥的名字叫“不准过桥”&从古至今，谁最怕热？#诸葛亮&世界上什么人一下子变老?#新娘.因为今天是新娘,明天是老婆&一颗心值多少钱?#1亿.因为一心一意嘛!&台风天气要带多少钱才能出门?#四千万.因为台风天气没,事千万不要出门&要考试了,不能看什么书?#百科全书(百科全输)";
	
	public String[] gaoxiaodata;
	public String[] youmodata;
	public String[] quweidata;
	public String[] dongwudata;
	public String[] jindiandata;
	public String[] zhengrendata;
	public String[] zonghedata;
	public String[] tesedata;
	public String[] fengqudata;
	
	
	public ContentData(){
		gaoxiaodata=gaoxiao.split("&");
		youmodata=youmo.split("&");
		quweidata=quwei.split("&");
		dongwudata=dongwu.split("&");
		jindiandata=jindian.split("&");
		zhengrendata=zhengren.split("&");
		zonghedata=zonghe.split("&");
		tesedata=tese.split("&");
		fengqudata=fengqu.split("&");
	}
	
	
	
	public String[] getZonghedata() {
		return zonghedata;
	}



	public void setZonghedata(String[] zonghedata) {
		this.zonghedata = zonghedata;
	}



	public String[] getTesedata() {
		return tesedata;
	}



	public void setTesedata(String[] tesedata) {
		this.tesedata = tesedata;
	}



	public String[] getFengqudata() {
		return fengqudata;
	}



	public void setFengqudata(String[] fengqudata) {
		this.fengqudata = fengqudata;
	}



	public String[] getZhengrendata() {
		return zhengrendata;
	}


	public void setZhengrendata(String[] zhengrendata) {
		this.zhengrendata = zhengrendata;
	}




	public String[] getJindiandata() {
		return jindiandata;
	}


	public void setJindiandata(String[] jindiandata) {
		this.jindiandata = jindiandata;
	}


	public String[] getDongwudata() {
		return dongwudata;
	}


	public void setDongwudata(String[] dongwudata) {
		this.dongwudata = dongwudata;
	}


	public String[] getQuweidata() {
		return quweidata;
	}


	public void setQuweidata(String[] quweidata) {
		this.quweidata = quweidata;
	}


	public String[] getGaoxiaodata() {
		return gaoxiaodata;
	}

	public String[] getYoumodata() {
		return youmodata;
	}

	public void setYoumodata(String[] youmodata) {
		this.youmodata = youmodata;
	}

	public void setGaoxiaodata(String[] gaoxiaodata) {
		this.gaoxiaodata = gaoxiaodata;
	}

	
	
	
}
